src/Reports/СверкаПоступленийНаЛинейки/СверкаПоступленийНаЛинейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>СверкаПоступленийНаЛинейки</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
</mdclass:Report>

src/Documents/ПоступлениеМПЗПрочее/ПоступлениеМПЗПрочее.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеМПЗПрочее</name>
  <basedOn>Document.ИнвентаризацияМПЗ</basedOn>
  <basedOn>Document.ДвижениеМПЗ</basedOn>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <registerRecords>AccumulationRegister.ГТД</registerRecords>
  <registerRecords>InformationRegister.Цены</registerRecords>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыПоставщикам</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ДвижениеМПЗ</types>
      <types>DocumentRef.ИнвентаризацияМПЗ</types>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Статья</name>
    <type>
      <types>CatalogRef.СтатьиПоступленийСписанийПрочих</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерИсходногоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>ВидМПЗ</name>
      <type>
        <types>EnumRef.ВидыМПЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГТД</name>
      <comment>Номер грузовой таможенной декларации</comment>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/Материалы/Материалы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Материалы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PartNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидБрака</name>
    <type>
      <types>CatalogRef.ВидыБрака</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМатериала</name>
    <type>
      <types>CatalogRef.ВидыМатериалов</types>
    </type>
  </attributes>
  <attributes>
    <name>Возвратный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаВариабельности</name>
    <type>
      <types>EnumRef.ГруппыВариабельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПоЗакупкам</name>
    <type>
      <types>EnumRef.ГруппыПоЗакупкам</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПересмотра</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументИВХ</name>
    <type>
      <types>CatalogRef.Документация</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерений</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаХранения</name>
    <type>
      <types>EnumRef.ЗоныХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>CatalogRef.Документация</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнициаторВнесения</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалПроверки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Каталогизатор</name>
    <type>
      <types>CatalogRef.Каталогизатор</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКЗаказу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУпаковок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьГрупповойУпаковки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьЗаготовки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьИндивидуальнойУпаковки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьУпаковки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Критичный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйЗапас</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МенеджерПоЗакупкам</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>МинОстаток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеSMD</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НормативРабочейЯчейки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеМодели</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПиковыеПродажи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолнНаименование</name>
    <comment>Полное наименование, краткие характеристики</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакНеделимойУпаковки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаВнесения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Производители</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрослеживаемыйТовар</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделПоЕСКД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокПоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтраховойЗапас</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипНормированияЗакупок</name>
    <type>
      <types>EnumRef.ТипыНормированияЗакупок</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПоставки</name>
    <type>
      <types>EnumRef.ТипыПоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРиска</name>
    <type>
      <types>EnumRef.ТипыРиска</types>
    </type>
  </attributes>
  <attributes>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Товары</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяВходнойКонтроль</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Фасовка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаНачГода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаПлановая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаФактическаяНачГода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапЖизненногоЦикла</name>
    <type>
      <types>CatalogRef.ЭтапыЖизненногоЦикла</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Аналоги</name>
    <attributes>
      <name>Аналог</name>
      <type>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтационарныеПитатели</name>
    <attributes>
      <name>Линейка</name>
      <type>
        <types>CatalogRef.Линейки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Замены</name>
    <attributes>
      <name>Материал</name>
      <type>
        <types>CatalogRef.Материалы</types>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Поставщики</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КоммерческиеПредложения</name>
    <attributes>
      <name>КП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>5</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаБыло</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСтало</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Reports/СверкаПоступленийНаЛинейки/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура СформироватьНаСервере()
ТабДок.Очистить();

Макет = Отчеты.СверкаПоступленийНаЛинейки.ПолучитьМакет("Макет");
ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблДок = Макет.ПолучитьОбласть("Док");
ОблДокОтклонение = Макет.ПолучитьОбласть("ДокОтклонение");
ОблМПЗ = Макет.ПолучитьОбласть("МПЗ");
ОблМПЗОтклонение = Макет.ПолучитьОбласть("МПЗОтклонение");
ОблКонец = Макет.ПолучитьОбласть("Конец");

ОблШапка.Параметры.ДатаНач = НачалоДня(Отчет.Период.ДатаНачала);
ОблШапка.Параметры.ДатаКон = КонецДня(Отчет.Период.ДатаОкончания);
ОблШапка.Параметры.Линейка = Отчет.Линейка;
ТабДок.Вывести(ОблШапка);

Запрос = Новый Запрос;
ЗапросТЧ = Новый Запрос;
ЗапросМПЗ = Новый Запрос;
ЗапросНомен = Новый Запрос;
СписокПоступлений = Новый СписокЗначений;
СписокМПЗ = Новый СписокЗначений;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДвижениеМПЗ.IDDOC КАК IDDOC,
	|	ЖурналДокументов.DOCNO,
	|	ПОДСТРОКА(ЖурналДокументов.DATE_TIME_IDDOC, 1, 8) КАК Дата
	|ИЗ
	|	ВнешнийИсточникДанных.Номенклатура1С77.Таблица.ДвижениеМПЗ КАК ДвижениеМПЗ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВнешнийИсточникДанных.Номенклатура1С77.Таблица.ЖурналДокументов КАК ЖурналДокументов
	|		ПО ДвижениеМПЗ.IDDOC = ЖурналДокументов.IDDOC
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВнешнийИсточникДанных.Номенклатура1С77.Таблица.МестаХранения КАК МестаХранения
	|		ПО ДвижениеМПЗ.SP14335 = МестаХранения.ID
	|ГДЕ
	|	ЖурналДокументов.DATE_TIME_IDDOC >= &ДатаНач
	|	И ЖурналДокументов.DATE_TIME_IDDOC <= &ДатаКон
	|	И МестаХранения.DESCR = &DESCR
	|	И ЖурналДокументов.ISMARK = ЛОЖЬ";
Запрос.УстановитьПараметр("ДатаНач",Формат(Отчет.Период.ДатаНачала,"ДФ=yyyyMMdd"));
Запрос.УстановитьПараметр("ДатаКон",Формат(Отчет.Период.ДатаОкончания+86400,"ДФ=yyyyMMdd"));
Запрос.УстановитьПараметр("DESCR",СокрЛП(Отчет.Линейка.МестоХраненияКанбанов.Наименование));
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	ПоступлениеПрочее = Документы.ПоступлениеМПЗПрочее.НайтиПоРеквизиту("НомерИсходногоДокумента",ВыборкаДетальныеЗаписи.DOCNO);
		Если Не ПоступлениеПрочее.Пустая() Тогда
		СписокМПЗ.Очистить();
		СписокПоступлений.Добавить(ПоступлениеПрочее);
			Если Формат(Дата(ВыборкаДетальныеЗаписи.Дата),"ДФ=dd.MM.yyyy") = Формат(ПоступлениеПрочее.Дата,"ДФ=dd.MM.yyyy") Тогда
			ОблДок.Параметры.ДокПеремещение = СокрЛП(ВыборкаДетальныеЗаписи.DOCNO)+" от "+Формат(Дата(ВыборкаДетальныеЗаписи.Дата),"ДФ=dd.MM.yyyy"); 			
			ОблДок.Параметры.ДокПоступлениеНомер = СокрЛП(ПоступлениеПрочее.Номер)+" от "+Формат(ПоступлениеПрочее.Дата,"ДФ=dd.MM.yyyy"); 
			ОблДок.Параметры.ДокПоступление = ПоступлениеПрочее.Ссылка;
			ОблДок.Параметры.НомерИсхДок = ПоступлениеПрочее.НомерИсходногоДокумента;
			ТабДок.Вывести(ОблДок);			
			Иначе
			ОблДокОтклонение.Параметры.ДокПеремещение = СокрЛП(ВыборкаДетальныеЗаписи.DOCNO)+" от "+Формат(Дата(ВыборкаДетальныеЗаписи.Дата),"ДФ=dd.MM.yyyy"); 			
			ОблДокОтклонение.Параметры.ДокПоступлениеНомер = СокрЛП(ПоступлениеПрочее.Номер)+" от "+Формат(ПоступлениеПрочее.Дата,"ДФ=dd.MM.yyyy"); 
			ОблДокОтклонение.Параметры.ДокПоступление = ПоступлениеПрочее.Ссылка;
			ОблДокОтклонение.Параметры.НомерИсхДок = ПоступлениеПрочее.НомерИсходногоДокумента;
			ТабДок.Вывести(ОблДокОтклонение);				
			КонецЕсли; 
		ЗапросТЧ.Текст = 
			"ВЫБРАТЬ
			|	ДвижениеМПЗ_ТЧ.SP20625,
			|	ДвижениеМПЗ_ТЧ.SP14336,
			|	ДвижениеМПЗ_ТЧ.SP14337
			|ИЗ
			|	ВнешнийИсточникДанных.Номенклатура1С77.Таблица.ДвижениеМПЗ_ТЧ КАК ДвижениеМПЗ_ТЧ
			|ГДЕ
			|	ДвижениеМПЗ_ТЧ.IDDOC = &IDDOC";	
		ЗапросТЧ.УстановитьПараметр("IDDOC",ВыборкаДетальныеЗаписи.IDDOC);	
		РезультатЗапросаТЧ = ЗапросТЧ.Выполнить();
		ВыборкаДетальныеЗаписиТЧ = РезультатЗапросаТЧ.Выбрать();
			Пока ВыборкаДетальныеЗаписиТЧ.Следующий() Цикл
				Если ВыборкаДетальныеЗаписиТЧ.SP20625 = "   39M   " Тогда					
				ЗапросМПЗ.Текст = 
					"ВЫБРАТЬ
					|	Материалы.DESCR
					|ИЗ
					|	ВнешнийИсточникДанных.Номенклатура1С77.Таблица.Материалы КАК Материалы
					|ГДЕ
					|	Материалы.ID = &ID";
				ID = Прав(ВыборкаДетальныеЗаписиТЧ.SP14336,9);	
				ЗапросМПЗ.УстановитьПараметр("ID",ID);	
				РезультатЗапросаМПЗ = ЗапросМПЗ.Выполнить();
				ВыборкаДетальныеЗаписиМПЗ = РезультатЗапросаМПЗ.Выбрать();
					Пока ВыборкаДетальныеЗаписиМПЗ.Следующий() Цикл
					МПЗ = Справочники.Материалы.НайтиПоРеквизиту("ID",ID);
					СписокМПЗ.Добавить(МПЗ);
					ТЧ = ПоступлениеПрочее.ТабличнаяЧасть.Найти(МПЗ,"МПЗ");
							Если ТЧ <> Неопределено Тогда
							КолПост = ТЧ.Количество;
							Иначе
							КолПост = 0;
							КонецЕсли;
								Если ВыборкаДетальныеЗаписиТЧ.SP14337 - КолПост = 0 Тогда
									Если Не ТолькоНесоответствия Тогда
									ОблМПЗ.Параметры.МПЗ = СокрЛП(ВыборкаДетальныеЗаписиМПЗ.DESCR);
									ОблМПЗ.Параметры.КолПерем = ВыборкаДетальныеЗаписиТЧ.SP14337;
									ОблМПЗ.Параметры.КолПост = КолПост;
									ТабДок.Вывести(ОблМПЗ);	
									КонецЕсли; 							
								Иначе
								ОблМПЗОтклонение.Параметры.МПЗ = СокрЛП(ВыборкаДетальныеЗаписиМПЗ.DESCR);
								ОблМПЗОтклонение.Параметры.КолПерем = ВыборкаДетальныеЗаписиТЧ.SP14337;
								ОблМПЗОтклонение.Параметры.КолПост = КолПост;
								ТабДок.Вывести(ОблМПЗОтклонение);						
								КонецЕсли; 
					КонецЦикла;				
				Иначе
				ЗапросМПЗ.Текст = 
					"ВЫБРАТЬ
					|	Номенклатура.DESCR
					|ИЗ
					|	ВнешнийИсточникДанных.Номенклатура1С77.Таблица.Номенклатура КАК Номенклатура
					|ГДЕ
					|	Номенклатура.ID = &ID";
				ID = Прав(ВыборкаДетальныеЗаписиТЧ.SP14336,9);						
				ЗапросМПЗ.УстановитьПараметр("ID",ID);	
				РезультатЗапросаМПЗ = ЗапросМПЗ.Выполнить();
				ВыборкаДетальныеЗаписиМПЗ = РезультатЗапросаМПЗ.Выбрать();
					Пока ВыборкаДетальныеЗаписиМПЗ.Следующий() Цикл
					МПЗ = Справочники.Номенклатура.НайтиПоРеквизиту("ID",ID);
					СписокМПЗ.Добавить(МПЗ);
					ТЧ = ПоступлениеПрочее.ТабличнаяЧасть.Найти(МПЗ,"МПЗ");
						Если ТЧ <> Неопределено Тогда
						КолПост = ТЧ.Количество;
						Иначе
						КолПост = 0;
						КонецЕсли;
							Если ВыборкаДетальныеЗаписиТЧ.SP14337 - КолПост = 0 Тогда
								Если Не ТолькоНесоответствия Тогда
								ОблМПЗ.Параметры.МПЗ = СокрЛП(ВыборкаДетальныеЗаписиМПЗ.DESCR);
								ОблМПЗ.Параметры.КолПерем = ВыборкаДетальныеЗаписиТЧ.SP14337;
								ОблМПЗ.Параметры.КолПост = КолПост;
								ТабДок.Вывести(ОблМПЗ);							
								КонецЕсли;
							Иначе
							ОблМПЗОтклонение.Параметры.МПЗ = СокрЛП(ВыборкаДетальныеЗаписиМПЗ.DESCR);
							ОблМПЗОтклонение.Параметры.КолПерем = ВыборкаДетальныеЗаписиТЧ.SP14337;
							ОблМПЗОтклонение.Параметры.КолПост = КолПост;
							ТабДок.Вывести(ОблМПЗОтклонение);						
							КонецЕсли; 
					КонецЦикла;						
				КонецЕсли; 				
			КонецЦикла;
				Для каждого ТЧ Из ПоступлениеПрочее.ТабличнаяЧасть Цикл
					Если СписокМПЗ.НайтиПоЗначению(ТЧ.МПЗ) = Неопределено Тогда
					ОблМПЗОтклонение.Параметры.МПЗ = СокрЛП(ТЧ.МПЗ.Наименование);
					ОблМПЗОтклонение.Параметры.КолПерем = 0;	
					ОблМПЗОтклонение.Параметры.КолПост = ТЧ.Количество;
					ТабДок.Вывести(ОблМПЗОтклонение);
					КонецЕсли; 
				КонецЦикла; 	
		Иначе
		ОблДокОтклонение.Параметры.ДокПеремещение = СокрЛП(ВыборкаДетальныеЗаписи.DOCNO)+" от "+Формат(Дата(ВыборкаДетальныеЗаписи.Дата),"ДФ=dd.MM.yyyy"); 				
		ОблДокОтклонение.Параметры.ДокПоступлениеНомер = "";
		ОблДокОтклонение.Параметры.ДокПоступление = "";
		ОблДокОтклонение.Параметры.НомерИсхДок = "";
		ТабДок.Вывести(ОблДокОтклонение);
		КонецЕсли; 
	КонецЦикла;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеМПЗПрочее.Ссылка,
	|	ПоступлениеМПЗПрочее.Номер,
	|	ПоступлениеМПЗПрочее.Дата,
	|	ПоступлениеМПЗПрочее.НомерИсходногоДокумента
	|ИЗ
	|	Документ.ПоступлениеМПЗПрочее КАК ПоступлениеМПЗПрочее
	|ГДЕ
	|	ПоступлениеМПЗПрочее.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И ПоступлениеМПЗПрочее.ПометкаУдаления = ЛОЖЬ
	|	И ПоступлениеМПЗПрочее.МестоХранения = &МестоХранения
	|	И ПоступлениеМПЗПрочее.НомерИсходногоДокумента <> """"";
Запрос.УстановитьПараметр("ДатаНач",Отчет.Период.ДатаНачала);
Запрос.УстановитьПараметр("ДатаКон",Отчет.Период.ДатаОкончания);
Запрос.УстановитьПараметр("МестоХранения",Отчет.Линейка.МестоХраненияКанбанов);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если СписокПоступлений.НайтиПоЗначению(ВыборкаДетальныеЗаписи.Ссылка) = Неопределено Тогда
		ОблДокОтклонение.Параметры.ДокПеремещение = "";
		ОблДокОтклонение.Параметры.ДокПоступлениеНомер = СокрЛП(ВыборкаДетальныеЗаписи.Номер)+" от "+Формат(ВыборкаДетальныеЗаписи.Дата,"ДФ=dd.MM.yyyy");
		ОблДокОтклонение.Параметры.ДокПоступление = ВыборкаДетальныеЗаписи.Ссылка;
		ОблДокОтклонение.Параметры.НомерИсхДок = ВыборкаДетальныеЗаписи.НомерИсходногоДокумента;
		ТабДок.Вывести(ОблДокОтклонение);
		КонецЕсли; 
	КонецЦикла;
ТабДок.Вывести(ОблКонец);
ТабДок.ФиксацияСверху = 3;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
СформироватьНаСервере();
КонецПроцедуры
